OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/lib/src/pic14/libdev/pic16f1789.c
__at(0x0513) __sfr OPA2CON;
__at(0x0513) volatile __OPA2CONbits_t OPA2CONbits;

__at(0x0515) __sfr OPA3CON;
__at(0x0515) volatile __OPA3CONbits_t OPA3CONbits;

__at(0x051A) __sfr CLKRCON;
__at(0x051A) volatile __CLKRCONbits_t CLKRCONbits;

__at(0x0591) __sfr DAC2CON0;
__at(0x0591) volatile __DAC2CON0bits_t DAC2CON0bits;

__at(0x0592) __sfr DAC2CON1;

__at(0x0592) __sfr DAC2REF;

__at(0x0593) __sfr DAC3CON0;
__at(0x0593) volatile __DAC3CON0bits_t DAC3CON0bits;

__at(0x0594) __sfr DAC3CON1;

__at(0x0594) __sfr DAC3REF;

__at(0x0595) __sfr DAC4CON0;
__at(0x0595) volatile __DAC4CON0bits_t DAC4CON0bits;

__at(0x0596) __sfr DAC4CON1;

__at(0x0596) __sfr DAC4REF;

__at(0x0E91) __sfr PSMC1CON;
__at(0x0E91) volatile __PSMC1CONbits_t PSMC1CONbits;

__at(0x0E92) __sfr PSMC1MDL;
__at(0x0E92) volatile __PSMC1MDLbits_t PSMC1MDLbits;

__at(0x0E93) __sfr PSMC1SYNC;
__at(0x0E93) volatile __PSMC1SYNCbits_t PSMC1SYNCbits;

__at(0x0E94) __sfr PSMC1CLK;
__at(0x0E94) volatile __PSMC1CLKbits_t PSMC1CLKbits;

__at(0x0E95) __sfr PSMC1OEN;
__at(0x0E95) volatile __PSMC1OENbits_t PSMC1OENbits;

__at(0x0E96) __sfr PSMC1POL;
__at(0x0E96) volatile __PSMC1POLbits_t PSMC1POLbits;

__at(0x0E97) __sfr PSMC1BLNK;
__at(0x0E97) volatile __PSMC1BLNKbits_t PSMC1BLNKbits;

__at(0x0E98) __sfr PSMC1REBS;
__at(0x0E98) volatile __PSMC1REBSbits_t PSMC1REBSbits;

__at(0x0E99) __sfr PSMC1FEBS;
__at(0x0E99) volatile __PSMC1FEBSbits_t PSMC1FEBSbits;

__at(0x0E9A) __sfr PSMC1PHS;
__at(0x0E9A) volatile __PSMC1PHSbits_t PSMC1PHSbits;

__at(0x0E9B) __sfr PSMC1DCS;
__at(0x0E9B) volatile __PSMC1DCSbits_t PSMC1DCSbits;

__at(0x0E9C) __sfr PSMC1PRS;
__at(0x0E9C) volatile __PSMC1PRSbits_t PSMC1PRSbits;

__at(0x0E9D) __sfr PSMC1ASDC;
__at(0x0E9D) volatile __PSMC1ASDCbits_t PSMC1ASDCbits;

__at(0x0E9E) __sfr PSMC1ASDL;
__at(0x0E9E) volatile __PSMC1ASDLbits_t PSMC1ASDLbits;

__at(0x0E9F) __sfr PSMC1ASDS;
__at(0x0E9F) volatile __PSMC1ASDSbits_t PSMC1ASDSbits;

__at(0x0EA0) __sfr PSMC1INT;
__at(0x0EA0) volatile __PSMC1INTbits_t PSMC1INTbits;

__at(0x0EA1) __sfr PSMC1PH;

__at(0x0EA1) __sfr PSMC1PHL;
__at(0x0EA1) volatile __PSMC1PHLbits_t PSMC1PHLbits;

__at(0x0EA2) __sfr PSMC1PHH;
__at(0x0EA2) volatile __PSMC1PHHbits_t PSMC1PHHbits;

__at(0x0EA3) __sfr PSMC1DC;

__at(0x0EA3) __sfr PSMC1DCL;
__at(0x0EA3) volatile __PSMC1DCLbits_t PSMC1DCLbits;

__at(0x0EA4) __sfr PSMC1DCH;
__at(0x0EA4) volatile __PSMC1DCHbits_t PSMC1DCHbits;

__at(0x0EA5) __sfr PSMC1PR;

__at(0x0EA5) __sfr PSMC1PRL;
__at(0x0EA5) volatile __PSMC1PRLbits_t PSMC1PRLbits;

__at(0x0EA6) __sfr PSMC1PRH;
__at(0x0EA6) volatile __PSMC1PRHbits_t PSMC1PRHbits;

__at(0x0EA7) __sfr PSMC1TMR;

__at(0x0EA7) __sfr PSMC1TMRL;
__at(0x0EA7) volatile __PSMC1TMRLbits_t PSMC1TMRLbits;

__at(0x0EA8) __sfr PSMC1TMRH;
__at(0x0EA8) volatile __PSMC1TMRHbits_t PSMC1TMRHbits;

__at(0x0EA9) __sfr PSMC1DBR;
__at(0x0EA9) volatile __PSMC1DBRbits_t PSMC1DBRbits;

__at(0x0EAA) __sfr PSMC1DBF;
__at(0x0EAA) volatile __PSMC1DBFbits_t PSMC1DBFbits;

__at(0x0EAB) __sfr PSMC1BLKR;
__at(0x0EAB) volatile __PSMC1BLKRbits_t PSMC1BLKRbits;

__at(0x0EAC) __sfr PSMC1BLKF;
__at(0x0EAC) volatile __PSMC1BLKFbits_t PSMC1BLKFbits;

__at(0x0EAD) __sfr PSMC1FFA;
__at(0x0EAD) volatile __PSMC1FFAbits_t PSMC1FFAbits;

__at(0x0EAE) __sfr PSMC1STR0;
__at(0x0EAE) volatile __PSMC1STR0bits_t PSMC1STR0bits;

__at(0x0EAF) __sfr PSMC1STR1;
__at(0x0EAF) volatile __PSMC1STR1bits_t PSMC1STR1bits;

__at(0x0EB1) __sfr PSMC2CON;
__at(0x0EB1) volatile __PSMC2CONbits_t PSMC2CONbits;

__at(0x0EB2) __sfr PSMC2MDL;
__at(0x0EB2) volatile __PSMC2MDLbits_t PSMC2MDLbits;

__at(0x0EB3) __sfr PSMC2SYNC;
__at(0x0EB3) volatile __PSMC2SYNCbits_t PSMC2SYNCbits;

__at(0x0EB4) __sfr PSMC2CLK;
__at(0x0EB4) volatile __PSMC2CLKbits_t PSMC2CLKbits;

__at(0x0EB5) __sfr PSMC2OEN;
__at(0x0EB5) volatile __PSMC2OENbits_t PSMC2OENbits;

__at(0x0EB6) __sfr PSMC2POL;
__at(0x0EB6) volatile __PSMC2POLbits_t PSMC2POLbits;

__at(0x0EB7) __sfr PSMC2BLNK;
__at(0x0EB7) volatile __PSMC2BLNKbits_t PSMC2BLNKbits;

__at(0x0EB8) __sfr PSMC2REBS;
__at(0x0EB8) volatile __PSMC2REBSbits_t PSMC2REBSbits;

__at(0x0EB9) __sfr PSMC2FEBS;
__at(0x0EB9) volatile __PSMC2FEBSbits_t PSMC2FEBSbits;

__at(0x0EBA) __sfr PSMC2PHS;
__at(0x0EBA) volatile __PSMC2PHSbits_t PSMC2PHSbits;

__at(0x0EBB) __sfr PSMC2DCS;
__at(0x0EBB) volatile __PSMC2DCSbits_t PSMC2DCSbits;

__at(0x0EBC) __sfr PSMC2PRS;
__at(0x0EBC) volatile __PSMC2PRSbits_t PSMC2PRSbits;

__at(0x0EBD) __sfr PSMC2ASDC;
__at(0x0EBD) volatile __PSMC2ASDCbits_t PSMC2ASDCbits;

__at(0x0EBE) __sfr PSMC2ASDL;
__at(0x0EBE) volatile __PSMC2ASDLbits_t PSMC2ASDLbits;

__at(0x0EBF) __sfr PSMC2ASDS;
__at(0x0EBF) volatile __PSMC2ASDSbits_t PSMC2ASDSbits;

__at(0x0EC0) __sfr PSMC2INT;
__at(0x0EC0) volatile __PSMC2INTbits_t PSMC2INTbits;

__at(0x0EC1) __sfr PSMC2PH;

__at(0x0EC1) __sfr PSMC2PHL;
__at(0x0EC1) volatile __PSMC2PHLbits_t PSMC2PHLbits;

__at(0x0EC2) __sfr PSMC2PHH;
__at(0x0EC2) volatile __PSMC2PHHbits_t PSMC2PHHbits;

__at(0x0EC3) __sfr PSMC2DC;

__at(0x0EC3) __sfr PSMC2DCL;
__at(0x0EC3) volatile __PSMC2DCLbits_t PSMC2DCLbits;

__at(0x0EC4) __sfr PSMC2DCH;
__at(0x0EC4) volatile __PSMC2DCHbits_t PSMC2DCHbits;

__at(0x0EC5) __sfr PSMC2PR;

__at(0x0EC5) __sfr PSMC2PRL;
__at(0x0EC5) volatile __PSMC2PRLbits_t PSMC2PRLbits;

__at(0x0EC6) __sfr PSMC2PRH;
__at(0x0EC6) volatile __PSMC2PRHbits_t PSMC2PRHbits;

__at(0x0EC7) __sfr PSMC2TMR;

__at(0x0EC7) __sfr PSMC2TMRL;
__at(0x0EC7) volatile __PSMC2TMRLbits_t PSMC2TMRLbits;

__at(0x0EC8) __sfr PSMC2TMRH;
__at(0x0EC8) volatile __PSMC2TMRHbits_t PSMC2TMRHbits;

__at(0x0EC9) __sfr PSMC2DBR;
__at(0x0EC9) volatile __PSMC2DBRbits_t PSMC2DBRbits;

__at(0x0ECA) __sfr PSMC2DBF;
__at(0x0ECA) volatile __PSMC2DBFbits_t PSMC2DBFbits;

__at(0x0ECB) __sfr PSMC2BLKR;
__at(0x0ECB) volatile __PSMC2BLKRbits_t PSMC2BLKRbits;

__at(0x0ECC) __sfr PSMC2BLKF;
__at(0x0ECC) volatile __PSMC2BLKFbits_t PSMC2BLKFbits;

__at(0x0ECD) __sfr PSMC2FFA;
__at(0x0ECD) volatile __PSMC2FFAbits_t PSMC2FFAbits;

__at(0x0ECE) __sfr PSMC2STR0;
__at(0x0ECE) volatile __PSMC2STR0bits_t PSMC2STR0bits;

__at(0x0ECF) __sfr PSMC2STR1;
__at(0x0ECF) volatile __PSMC2STR1bits_t PSMC2STR1bits;

__at(0x0ED1) __sfr PSMC3CON;
__at(0x0ED1) volatile __PSMC3CONbits_t PSMC3CONbits;

__at(0x0ED2) __sfr PSMC3MDL;
__at(0x0ED2) volatile __PSMC3MDLbits_t PSMC3MDLbits;

__at(0x0ED3) __sfr PSMC3SYNC;
__at(0x0ED3) volatile __PSMC3SYNCbits_t PSMC3SYNCbits;

__at(0x0ED4) __sfr PSMC3CLK;
__at(0x0ED4) volatile __PSMC3CLKbits_t PSMC3CLKbits;

__at(0x0ED5) __sfr PSMC3OEN;
__at(0x0ED5) volatile __PSMC3OENbits_t PSMC3OENbits;

__at(0x0ED6) __sfr PSMC3POL;
__at(0x0ED6) volatile __PSMC3POLbits_t PSMC3POLbits;

__at(0x0ED7) __sfr PSMC3BLNK;
__at(0x0ED7) volatile __PSMC3BLNKbits_t PSMC3BLNKbits;

