OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/lib/src/pic14/libdev/pic16f1789.c
__at(0x0ED8) __sfr PSMC3REBS;
__at(0x0ED8) volatile __PSMC3REBSbits_t PSMC3REBSbits;

__at(0x0ED9) __sfr PSMC3FEBS;
__at(0x0ED9) volatile __PSMC3FEBSbits_t PSMC3FEBSbits;

__at(0x0EDA) __sfr PSMC3PHS;
__at(0x0EDA) volatile __PSMC3PHSbits_t PSMC3PHSbits;

__at(0x0EDB) __sfr PSMC3DCS;
__at(0x0EDB) volatile __PSMC3DCSbits_t PSMC3DCSbits;

__at(0x0EDC) __sfr PSMC3PRS;
__at(0x0EDC) volatile __PSMC3PRSbits_t PSMC3PRSbits;

__at(0x0EDD) __sfr PSMC3ASDC;
__at(0x0EDD) volatile __PSMC3ASDCbits_t PSMC3ASDCbits;

__at(0x0EDE) __sfr PSMC3ASDL;
__at(0x0EDE) volatile __PSMC3ASDLbits_t PSMC3ASDLbits;

__at(0x0EDF) __sfr PSMC3ASDS;
__at(0x0EDF) volatile __PSMC3ASDSbits_t PSMC3ASDSbits;

__at(0x0EE0) __sfr PSMC3INT;
__at(0x0EE0) volatile __PSMC3INTbits_t PSMC3INTbits;

__at(0x0EE1) __sfr PSMC3PH;

__at(0x0EE1) __sfr PSMC3PHL;
__at(0x0EE1) volatile __PSMC3PHLbits_t PSMC3PHLbits;

__at(0x0EE2) __sfr PSMC3PHH;
__at(0x0EE2) volatile __PSMC3PHHbits_t PSMC3PHHbits;

__at(0x0EE3) __sfr PSMC3DC;

__at(0x0EE3) __sfr PSMC3DCL;
__at(0x0EE3) volatile __PSMC3DCLbits_t PSMC3DCLbits;

__at(0x0EE4) __sfr PSMC3DCH;
__at(0x0EE4) volatile __PSMC3DCHbits_t PSMC3DCHbits;

__at(0x0EE5) __sfr PSMC3PR;

__at(0x0EE5) __sfr PSMC3PRL;
__at(0x0EE5) volatile __PSMC3PRLbits_t PSMC3PRLbits;

__at(0x0EE6) __sfr PSMC3PRH;
__at(0x0EE6) volatile __PSMC3PRHbits_t PSMC3PRHbits;

__at(0x0EE7) __sfr PSMC3TMR;

__at(0x0EE7) __sfr PSMC3TMRL;
__at(0x0EE7) volatile __PSMC3TMRLbits_t PSMC3TMRLbits;

__at(0x0EE8) __sfr PSMC3TMRH;
__at(0x0EE8) volatile __PSMC3TMRHbits_t PSMC3TMRHbits;

__at(0x0EE9) __sfr PSMC3DBR;
__at(0x0EE9) volatile __PSMC3DBRbits_t PSMC3DBRbits;

__at(0x0EEA) __sfr PSMC3DBF;
__at(0x0EEA) volatile __PSMC3DBFbits_t PSMC3DBFbits;

__at(0x0EEB) __sfr PSMC3BLKR;
__at(0x0EEB) volatile __PSMC3BLKRbits_t PSMC3BLKRbits;

__at(0x0EEC) __sfr PSMC3BLKF;
__at(0x0EEC) volatile __PSMC3BLKFbits_t PSMC3BLKFbits;

__at(0x0EED) __sfr PSMC3FFA;
__at(0x0EED) volatile __PSMC3FFAbits_t PSMC3FFAbits;

__at(0x0EEE) __sfr PSMC3STR0;
__at(0x0EEE) volatile __PSMC3STR0bits_t PSMC3STR0bits;

__at(0x0EEF) __sfr PSMC3STR1;
__at(0x0EEF) volatile __PSMC3STR1bits_t PSMC3STR1bits;

__at(0x0F11) __sfr PSMC4CON;
__at(0x0F11) volatile __PSMC4CONbits_t PSMC4CONbits;

__at(0x0F12) __sfr PSMC4MDL;
__at(0x0F12) volatile __PSMC4MDLbits_t PSMC4MDLbits;

__at(0x0F13) __sfr PSMC4SYNC;
__at(0x0F13) volatile __PSMC4SYNCbits_t PSMC4SYNCbits;

__at(0x0F14) __sfr PSMC4CLK;
__at(0x0F14) volatile __PSMC4CLKbits_t PSMC4CLKbits;

__at(0x0F15) __sfr PSMC4OEN;
__at(0x0F15) volatile __PSMC4OENbits_t PSMC4OENbits;

__at(0x0F16) __sfr PSMC4POL;
__at(0x0F16) volatile __PSMC4POLbits_t PSMC4POLbits;

__at(0x0F17) __sfr PSMC4BLNK;
__at(0x0F17) volatile __PSMC4BLNKbits_t PSMC4BLNKbits;

__at(0x0F18) __sfr PSMC4REBS;
__at(0x0F18) volatile __PSMC4REBSbits_t PSMC4REBSbits;

__at(0x0F19) __sfr PSMC4FEBS;
__at(0x0F19) volatile __PSMC4FEBSbits_t PSMC4FEBSbits;

__at(0x0F1A) __sfr PSMC4PHS;
__at(0x0F1A) volatile __PSMC4PHSbits_t PSMC4PHSbits;

__at(0x0F1B) __sfr PSMC4DCS;
__at(0x0F1B) volatile __PSMC4DCSbits_t PSMC4DCSbits;

__at(0x0F1C) __sfr PSMC4PRS;
__at(0x0F1C) volatile __PSMC4PRSbits_t PSMC4PRSbits;

__at(0x0F1D) __sfr PSMC4ASDC;
__at(0x0F1D) volatile __PSMC4ASDCbits_t PSMC4ASDCbits;

__at(0x0F1E) __sfr PSMC4ASDL;
__at(0x0F1E) volatile __PSMC4ASDLbits_t PSMC4ASDLbits;

__at(0x0F1F) __sfr PSMC4ASDS;
__at(0x0F1F) volatile __PSMC4ASDSbits_t PSMC4ASDSbits;

__at(0x0F20) __sfr PSMC4INT;
__at(0x0F20) volatile __PSMC4INTbits_t PSMC4INTbits;

__at(0x0F21) __sfr PSMC4PH;

__at(0x0F21) __sfr PSMC4PHL;
__at(0x0F21) volatile __PSMC4PHLbits_t PSMC4PHLbits;

__at(0x0F22) __sfr PSMC4PHH;
__at(0x0F22) volatile __PSMC4PHHbits_t PSMC4PHHbits;

__at(0x0F23) __sfr PSMC4DC;

__at(0x0F23) __sfr PSMC4DCL;
__at(0x0F23) volatile __PSMC4DCLbits_t PSMC4DCLbits;

__at(0x0F24) __sfr PSMC4DCH;
__at(0x0F24) volatile __PSMC4DCHbits_t PSMC4DCHbits;

__at(0x0F25) __sfr PSMC4PR;

__at(0x0F25) __sfr PSMC4PRL;
__at(0x0F25) volatile __PSMC4PRLbits_t PSMC4PRLbits;

__at(0x0F26) __sfr PSMC4PRH;
__at(0x0F26) volatile __PSMC4PRHbits_t PSMC4PRHbits;

__at(0x0F27) __sfr PSMC4TMR;

__at(0x0F27) __sfr PSMC4TMRL;
__at(0x0F27) volatile __PSMC4TMRLbits_t PSMC4TMRLbits;

__at(0x0F28) __sfr PSMC4TMRH;
__at(0x0F28) volatile __PSMC4TMRHbits_t PSMC4TMRHbits;

__at(0x0F29) __sfr PSMC4DBR;
__at(0x0F29) volatile __PSMC4DBRbits_t PSMC4DBRbits;

__at(0x0F2A) __sfr PSMC4DBF;
__at(0x0F2A) volatile __PSMC4DBFbits_t PSMC4DBFbits;

__at(0x0F2B) __sfr PSMC4BLKR;
__at(0x0F2B) volatile __PSMC4BLKRbits_t PSMC4BLKRbits;

__at(0x0F2C) __sfr PSMC4BLKF;
__at(0x0F2C) volatile __PSMC4BLKFbits_t PSMC4BLKFbits;

__at(0x0F2D) __sfr PSMC4FFA;
__at(0x0F2D) volatile __PSMC4FFAbits_t PSMC4FFAbits;

__at(0x0F2E) __sfr PSMC4STR0;
__at(0x0F2E) volatile __PSMC4STR0bits_t PSMC4STR0bits;

__at(0x0F2F) __sfr PSMC4STR1;
__at(0x0F2F) volatile __PSMC4STR1bits_t PSMC4STR1bits;

__at(0x0FE4) __sfr STATUS_SHAD;
__at(0x0FE4) volatile __STATUS_SHADbits_t STATUS_SHADbits;

__at(0x0FE5) __sfr WREG_SHAD;

__at(0x0FE6) __sfr BSR_SHAD;

__at(0x0FE7) __sfr PCLATH_SHAD;

__at(0x0FE8) __sfr FSR0L_SHAD;

__at(0x0FE9) __sfr FSR0H_SHAD;

__at(0x0FEA) __sfr FSR1L_SHAD;

__at(0x0FEB) __sfr FSR1H_SHAD;

__at(0x0FED) __sfr STKPTR;

__at(0x0FEE) __sfr TOSL;

__at(0x0FEF) __sfr TOSH;
